---
kind: type
id: T:Autodesk.Revit.DB.WallFunction
source: html/ccafc685-892f-511b-1db6-e7bf1116268d.htm
---
# Autodesk.Revit.DB.WallFunction

Indicates the function of a specified WallType, as specified in the parameter FUNCTION_PARAM on the WallType.

## Syntax (C#)
```csharp
public enum WallFunction
```